Revit 2027 API
MultiReferenceAnnotationType.DimensionStyleId Property
 The dimension style which will be used by the child dimension of the multi-reference annotation.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId DimensionStyleId { get; set; }
Public Property DimensionStyleId As ElementId
	Get
	Set
public:
property ElementId^ DimensionStyleId {
	ElementId^ get ();
	void set (ElementId^ value);
}
member DimensionStyleId : ElementId with get, set
Property Value
ElementId
 Only linear dimension styles can be used.
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The dimension style is not allowed.
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
MultiReferenceAnnotationType Class
Autodesk.Revit.DB Namespace